In [1]:
2+2

4

In [2]:
8**2

64

In [3]:
8*2

16

In [4]:
number = 3

In [6]:
number + 6

9

# Heading

- dashed
- list

In [82]:
import pandas as pd
import altair

ModuleNotFoundError: No module named 'altair'

In [8]:
my_list = [1, 2, 4, 69]

In [9]:
my_series = pd.Series(my_list)

In [10]:
my_series

0     1
1     2
2     4
3    69
dtype: int64

In [11]:
my_series.sum()

76

In [12]:
my_series.max()

69

In [14]:
max(my_list)

69

In [15]:
my_series.min()

1

In [16]:
my_series.mean()

19.0

In [17]:
my_series.median()

3.0

In [18]:
my_series.std()

33.35665850571167

In [19]:
my_series.describe()

count     4.000000
mean     19.000000
std      33.356659
min       1.000000
25%       1.750000
50%       3.000000
75%      20.250000
max      69.000000
dtype: float64

In [20]:
accident_list = pd.read_csv("https://raw.githubusercontent.com/palewire/first-python-notebook/main/docs/src/_static/ntsb-accidents.csv")

In [21]:
accident_list

,event_id,ntsb_make,ntsb_model,ntsb_number,year,date,city,state,country,total_fatalities,latimes_make,latimes_model,latimes_make_and_model
0,20061222X01838,BELL,407,NYC07FA048,2006,12/14/06 00:00:00,DAGSBORO,DE,USA,2,BELL,407,BELL 407
1,20060817X01187,ROBINSON,R22 BETA,LAX06LA257,2006,08/10/06 00:00:00,TUCSON,AZ,USA,1,ROBINSON,R22,ROBINSON R22
2,20060111X00044,ROBINSON,R44,MIA06FA039,2006,01/01/06 00:00:00,GRAND RIDGE,FL,USA,3,ROBINSON,R44,ROBINSON R44
3,20060419X00461,ROBINSON,R44 II,DFW06FA102,2006,04/13/06 00:00:00,FREDERICKSBURG,TX,USA,2,ROBINSON,R44,ROBINSON R44
4,20060208X00181,ROBINSON,R44,SEA06LA052,2006,02/06/06 00:00:00,HELENA,MT,USA,1,ROBINSON,R44,ROBINSON R44
...,...,...,...,...,...,...,...,...,...,...,...,...,...
158,20160711X32921,BELL HELICOPTER TEXTRON CANADA,407,ERA16FA248,2016,07/11/16 00:00:00,HICKORY,KY,USA,1,BELL,407,BELL 407
159,20160804X45514,SCHWEIZER,269C 1,CEN16FA304,2016,08/03/16 00:00:00,JEANERETTE,LA,USA,1,SCHWEIZER,269,SCHWEIZER 269
160,20160404X74644,BELL,206,ERA16FA144,2016,04/04/16 00:00:00,PIGEON FORGE,TN,USA,5,BELL,206,BELL 206
161,20160507X31120,AIRBUS,AS350,ANC16FA023,2016,05/06/16 00:00:00,SKAGWAY,AK,USA,1,AIRBUS,350,AIRBUS 350
162,20160612X85856,ROBINSON HELICOPTER COMPANY,R44 II,CEN16FA215,2016,06/12/16 00:00:00,JONESBORO,AR,USA,1,ROBINSON,R44,ROBINSON R44

In [23]:
accident_list.head(10)

,event_id,ntsb_make,ntsb_model,ntsb_number,year,date,city,state,country,total_fatalities,latimes_make,latimes_model,latimes_make_and_model
0,20061222X01838,BELL,407,NYC07FA048,2006,12/14/06 00:00:00,DAGSBORO,DE,USA,2,BELL,407,BELL 407
1,20060817X01187,ROBINSON,R22 BETA,LAX06LA257,2006,08/10/06 00:00:00,TUCSON,AZ,USA,1,ROBINSON,R22,ROBINSON R22
2,20060111X00044,ROBINSON,R44,MIA06FA039,2006,01/01/06 00:00:00,GRAND RIDGE,FL,USA,3,ROBINSON,R44,ROBINSON R44
3,20060419X00461,ROBINSON,R44 II,DFW06FA102,2006,04/13/06 00:00:00,FREDERICKSBURG,TX,USA,2,ROBINSON,R44,ROBINSON R44
4,20060208X00181,ROBINSON,R44,SEA06LA052,2006,02/06/06 00:00:00,HELENA,MT,USA,1,ROBINSON,R44,ROBINSON R44
5,20060228X00255,ROBINSON,R22,ANC06FA020,2006,02/22/06 00:00:00,SCOTTSDALE,AZ,USA,2,ROBINSON,R22,ROBINSON R22
6,20060824X01237,EUROCOPTER,AS-350-B3,SEA06GA158,2006,08/13/06 00:00:00,YELLOW PINE,ID,USA,4,AIRBUS,350,AIRBUS 350
7,20060916X01352,HUGHES,369D,LAX06LA288,2006,09/06/06 00:00:00,SOMIS,CA,USA,2,HUGHES,369,HUGHES 369
8,20061122X01705,HUGHES,369E,SEA07LA021,2006,11/21/06 00:00:00,JENSEN,UT,USA,1,HUGHES,369,HUGHES 369
9,20060306X00268,SCHWEIZER,269C-1,LAX06LA123,2006,02/25/06 00:00:00,VALENCIA,CA,USA,1,SCHWEIZER,269,SCHWEIZER 269

In [24]:
accident_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163 entries, 0 to 162
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   event_id                163 non-null    object
 1   ntsb_make               163 non-null    object
 2   ntsb_model              163 non-null    object
 3   ntsb_number             163 non-null    object
 4   year                    163 non-null    int64
 5   date                    163 non-null    object
 6   city                    163 non-null    object
 7   state                   162 non-null    object
 8   country                 163 non-null    object
 9   total_fatalities        163 non-null    int64
 10  latimes_make            163 non-null    object
 11  latimes_model           163 non-null    object
 12  latimes_make_and_model  163 non-null    object
dtypes: int64(2), object(11)
memory usage: 16.7+ KB

In [25]:
accident_list['latimes_make_and_model']

0           BELL 407
1       ROBINSON R22
2       ROBINSON R44
3       ROBINSON R44
4       ROBINSON R44
           ...
158         BELL 407
159    SCHWEIZER 269
160         BELL 206
161       AIRBUS 350
162     ROBINSON R44
Name: latimes_make_and_model, Length: 163, dtype: object

In [26]:
accident_list['latimes_make_and_model'].value_counts()

latimes_make_and_model
ROBINSON R44             38
BELL 206                 30
AIRBUS 350               29
ROBINSON R22             20
BELL 407                 13
HUGHES 369               13
MCDONNELL DOUGLAS 369     6
SCHWEIZER 269             5
AIRBUS 135                4
SIKORSKY 76               2
AGUSTA 109                2
AIRBUS 130                1
Name: count, dtype: int64

In [31]:
accident_df = accident_list['latimes_make_and_model'].value_counts().reset_index()

In [32]:
accident_df['count'].sum()

163

In [34]:
accident_list['ntsb_make'].value_counts()

ntsb_make
BELL                              37
ROBINSON                          25
EUROCOPTER                        18
ROBINSON HELICOPTER               18
ROBINSON HELICOPTER COMPANY       15
HUGHES                            13
SCHWEIZER                          5
AEROSPATIALE                       5
BELL HELICOPTER TEXTRON            4
AIRBUS HELICOPTERS                 2
MCDONNELL DOUGLAS HELICOPTER       2
AGUSTA SPA                         2
SIKORSKY                           2
MCDONNELL DOUGLAS HELI CO          2
EUROCOPTER DEUTSCHLAND GMBH        2
EUROCOPTER FRANCE                  2
AMERICAN EUROCOPTER LLC            1
MD HELICOPTERS INC                 1
BELL HELICOPTER                    1
MCDONNELL DOUGLAS                  1
AMERICAN EUROCOPTER CORP           1
AIRBUS HELICOPTERS INC             1
AIRBUS HELICOPTERS (EUROCOPTE      1
BELL HELICOPTER TEXTRON CANADA     1
AIRBUS                             1
Name: count, dtype: int64

In [35]:
accident_list['year'].value_counts()

year
2008    22
2006    20
2010    18
2013    18
2014    17
2007    16
2012    16
2009    15
2015    11
2016    10
Name: count, dtype: int64

In [36]:
accident_list['state'].value_counts()

state
CA    16
TX    15
AZ    14
FL     9
WA     8
LA     8
TN     6
AK     6
AL     5
UT     5
OK     5
MT     4
HI     4
MO     4
OR     4
GM     3
WI     3
KY     3
PA     3
NM     3
CO     3
IA     3
IN     2
NV     2
NC     2
MD     2
AR     2
VA     2
MS     2
NY     2
MA     1
WV     1
WY     1
DE     1
GA     1
KS     1
NJ     1
SC     1
MI     1
DC     1
ID     1
PR     1
Name: count, dtype: int64

In [37]:
my_state = "IA"

In [38]:
accident_list[accident_list['state'] == my_state]

,event_id,ntsb_make,ntsb_model,ntsb_number,year,date,city,state,country,total_fatalities,latimes_make,latimes_model,latimes_make_and_model
12,20060705X00868,BELL,206B,CHI06FA173,2006,06/30/06 00:00:00,WALFORD,IA,USA,1,BELL,206,BELL 206
118,20130102X35708,BELL HELICOPTER,407,CEN13FA122,2013,01/02/13 00:00:00,CLEAR LAKE,IA,USA,3,BELL,407,BELL 407
140,20140908X10448,ROBINSON HELICOPTER COMPANY,R44 II,CEN14LA487,2014,09/06/14 00:00:00,MACEDONIA,IA,USA,1,ROBINSON,R44,ROBINSON R44

In [39]:
my_accidents = accident_list[accident_list['state'] == my_state]

In [41]:
my_accidents.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 12 to 140
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   event_id                3 non-null      object
 1   ntsb_make               3 non-null      object
 2   ntsb_model              3 non-null      object
 3   ntsb_number             3 non-null      object
 4   year                    3 non-null      int64
 5   date                    3 non-null      object
 6   city                    3 non-null      object
 7   state                   3 non-null      object
 8   country                 3 non-null      object
 9   total_fatalities        3 non-null      int64
 10  latimes_make            3 non-null      object
 11  latimes_model           3 non-null      object
 12  latimes_make_and_model  3 non-null      object
dtypes: int64(2), object(11)
memory usage: 336.0+ bytes

In [42]:
accident_list[accident_list['state'] == 'MI']

,event_id,ntsb_make,ntsb_model,ntsb_number,year,date,city,state,country,total_fatalities,latimes_make,latimes_model,latimes_make_and_model
11,20060419X00457,ROBINSON,R22 BETA,CHI06FA109,2006,04/13/06 00:00:00,CHELSEA,MI,USA,2,ROBINSON,R22,ROBINSON R22

In [44]:
more_than_one_fatal = accident_list[accident_list['total_fatalities'] > 1]

In [45]:
more_than_one_fatal.info()

<class 'pandas.core.frame.DataFrame'>
Index: 89 entries, 0 to 160
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   event_id                89 non-null     object
 1   ntsb_make               89 non-null     object
 2   ntsb_model              89 non-null     object
 3   ntsb_number             89 non-null     object
 4   year                    89 non-null     int64
 5   date                    89 non-null     object
 6   city                    89 non-null     object
 7   state                   89 non-null     object
 8   country                 89 non-null     object
 9   total_fatalities        89 non-null     int64
 10  latimes_make            89 non-null     object
 11  latimes_model           89 non-null     object
 12  latimes_make_and_model  89 non-null     object
dtypes: int64(2), object(11)
memory usage: 9.7+ KB

In [56]:
ca = accident_list[accident_list['state'] == 'CA']

In [57]:
ca_2015 = ca[ca['year'] == 2015]

In [58]:
ca_2015.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 148 to 152
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   event_id                2 non-null      object
 1   ntsb_make               2 non-null      object
 2   ntsb_model              2 non-null      object
 3   ntsb_number             2 non-null      object
 4   year                    2 non-null      int64
 5   date                    2 non-null      object
 6   city                    2 non-null      object
 7   state                   2 non-null      object
 8   country                 2 non-null      object
 9   total_fatalities        2 non-null      int64
 10  latimes_make            2 non-null      object
 11  latimes_model           2 non-null      object
 12  latimes_make_and_model  2 non-null      object
dtypes: int64(2), object(11)
memory usage: 224.0+ bytes

In [59]:
ca.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16 entries, 7 to 152
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   event_id                16 non-null     object
 1   ntsb_make               16 non-null     object
 2   ntsb_model              16 non-null     object
 3   ntsb_number             16 non-null     object
 4   year                    16 non-null     int64
 5   date                    16 non-null     object
 6   city                    16 non-null     object
 7   state                   16 non-null     object
 8   country                 16 non-null     object
 9   total_fatalities        16 non-null     int64
 10  latimes_make            16 non-null     object
 11  latimes_model           16 non-null     object
 12  latimes_make_and_model  16 non-null     object
dtypes: int64(2), object(11)
memory usage: 1.8+ KB

In [60]:
accident_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163 entries, 0 to 162
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   event_id                163 non-null    object
 1   ntsb_make               163 non-null    object
 2   ntsb_model              163 non-null    object
 3   ntsb_number             163 non-null    object
 4   year                    163 non-null    int64
 5   date                    163 non-null    object
 6   city                    163 non-null    object
 7   state                   162 non-null    object
 8   country                 163 non-null    object
 9   total_fatalities        163 non-null    int64
 10  latimes_make            163 non-null    object
 11  latimes_model           163 non-null    object
 12  latimes_make_and_model  163 non-null    object
dtypes: int64(2), object(11)
memory usage: 16.7+ KB

In [61]:
16/163

0.09815950920245399

In [62]:
accident_list.groupby("latimes_make_and_model").size()

latimes_make_and_model
AGUSTA 109                2
AIRBUS 130                1
AIRBUS 135                4
AIRBUS 350               29
BELL 206                 30
BELL 407                 13
HUGHES 369               13
MCDONNELL DOUGLAS 369     6
ROBINSON R22             20
ROBINSON R44             38
SCHWEIZER 269             5
SIKORSKY 76               2
dtype: int64

In [64]:
accident_list.groupby("latimes_make_and_model")['total_fatalities'].sum().reset_index()

   latimes_make_and_model  total_fatalities
0              AGUSTA 109                 5
1              AIRBUS 130                 1
2              AIRBUS 135                11
3              AIRBUS 350                81
4                BELL 206                61
5                BELL 407                35
6              HUGHES 369                19
7   MCDONNELL DOUGLAS 369                 7
8            ROBINSON R22                27
9            ROBINSON R44                71
10          SCHWEIZER 269                 7
11            SIKORSKY 76                11

In [66]:
accident_counts = accident_list.groupby("latimes_make_and_model").size().rename("accidents").reset_index()

In [67]:
survey = pd.read_csv("https://raw.githubusercontent.com/palewire/first-python-notebook/main/docs/src/_static/faa-survey.csv")

In [68]:
survey.head()

  latimes_make_and_model  total_hours
0             AGUSTA 109       362172
1             AIRBUS 130      1053786
2             AIRBUS 135       884596
3             AIRBUS 350      3883490
4               BELL 206      5501308

In [69]:
merged_list = pd.merge(accident_counts, survey, on="latimes_make_and_model")

In [70]:
merged_list.head()

  latimes_make_and_model  accidents  total_hours
0             AGUSTA 109          2       362172
1             AIRBUS 130          1      1053786
2             AIRBUS 135          4       884596
3             AIRBUS 350         29      3883490
4               BELL 206         30      5501308

In [71]:
merged_list.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   latimes_make_and_model  12 non-null     object
 1   accidents               12 non-null     int64
 2   total_hours             12 non-null     int64
dtypes: int64(2), object(1)
memory usage: 416.0+ bytes

In [72]:
accident_counts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   latimes_make_and_model  12 non-null     object
 1   accidents               12 non-null     int64
dtypes: int64(1), object(1)
memory usage: 320.0+ bytes

In [74]:
merged_list['per_hour'] = merged_list['accidents'] / merged_list['total_hours']

In [75]:
merged_list['per_hour'].head()

0    5.522238e-06
1    9.489593e-07
2    4.521838e-06
3    7.467510e-06
4    5.453249e-06
Name: per_hour, dtype: float64

In [76]:
merged_list['per_100k_hours'] = merged_list['per_hour'] * 100_000

In [77]:
merged_list['per_100k_hours'].head()

0    0.552224
1    0.094896
2    0.452184
3    0.746751
4    0.545325
Name: per_100k_hours, dtype: float64

In [78]:
merged_list.sort_values("per_100k_hours")

,latimes_make_and_model,accidents,total_hours,per_hour,per_100k_hours
1,AIRBUS 130,1,1053786,9.489593e-07,0.094896
11,SIKORSKY 76,2,915515,2.184563e-06,0.218456
10,SCHWEIZER 269,5,1139326,4.388560e-06,0.438856
2,AIRBUS 135,4,884596,4.521838e-06,0.452184
4,BELL 206,30,5501308,5.453249e-06,0.545325
0,AGUSTA 109,2,362172,5.522238e-06,0.552224
5,BELL 407,13,2113788,6.150096e-06,0.615010
8,ROBINSON R22,20,2970806,6.732180e-06,0.673218
3,AIRBUS 350,29,3883490,7.467510e-06,0.746751
6,HUGHES 369,13,1201688,1.081812e-05,1.081812
7,MCDONNELL DOUGLAS 369,6,550689,1.089544e-05,1.089544
9,ROBINSON R44,38,2359729,1.610354e-05,1.610354

In [79]:
merged_list.sort_values("per_100k_hours", ascending=False)

,latimes_make_and_model,accidents,total_hours,per_hour,per_100k_hours
9,ROBINSON R44,38,2359729,1.610354e-05,1.610354
7,MCDONNELL DOUGLAS 369,6,550689,1.089544e-05,1.089544
6,HUGHES 369,13,1201688,1.081812e-05,1.081812
3,AIRBUS 350,29,3883490,7.467510e-06,0.746751
8,ROBINSON R22,20,2970806,6.732180e-06,0.673218
5,BELL 407,13,2113788,6.150096e-06,0.615010
0,AGUSTA 109,2,362172,5.522238e-06,0.552224
4,BELL 206,30,5501308,5.453249e-06,0.545325
2,AIRBUS 135,4,884596,4.521838e-06,0.452184
10,SCHWEIZER 269,5,1139326,4.388560e-06,0.438856
11,SIKORSKY 76,2,915515,2.184563e-06,0.218456
1,AIRBUS 130,1,1053786,9.489593e-07,0.094896

ModuleNotFoundError: No module named 'altair'